bench/profiles/bounded/async-patched/native-mars-time-3.wrk.txt
Running 5s test @ http://127.0.0.1:55240/api/users/123
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   497.71us  193.50us   7.80ms   95.81%
    Req/Sec    31.95k     2.72k   35.16k    79.90%
  Latency Distribution
     50%  467.00us
     75%  498.00us
     90%  550.00us
     99%    1.11ms
  648355 requests in 5.10s, 62.45MB read
Requests/sec: 127117.14
Transfer/sec:     12.24MB